app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
    def index
      @all_ratings =  Movie.all_ratings
      @param_ratings =  params[:ratings].nil? ? {} : params[:ratings]
      @ratings_to_show = params[:ratings].nil? ?  @all_ratings : params[:ratings].keys ;

      @sort = params[:sort].nil? ? "" : params[:sort]
      unless (params[:sort].present? && params[:ratings].present?)
        h = {}.compare_by_identity
        @all_ratings.each_with_index{|k,v| h[k] = v}
        redirect_to movies_path(sort: session[:sort] || "id" , ratings: session[:ratings] || h)
        return
      end
      session[:ratings] =  params[:ratings]
      session[:sort] = params[:sort]

      @movies = Movie.with_ratings(@ratings_to_show).order(@sort)